mferi87/yieldassist/firmware/esp8266_mock/src/main.cpp
#include <LittleFS.h>
#include <ESP8266WiFi.h>
#include <DNSServer.h>
#include <ESP8266WebServer.h>
#include <WiFiManager.h>
#include <ESP8266HTTPClient.h>
#include <ArduinoJson.h>
#include <map>
#include <set>
#include <algorithm>

// Mock Device Configuration
#define SENSOR_SOIL_MOISTURE "soil_moisture"
#define SENSOR_TEMPERATURE "temperature"
#define SENSOR_LIGHT "light"

// Default values
char api_server[64] = "http://192.168.1.100:8000";
char user_email[64] = "admin@example.com";

// Configuration flags
bool shouldSaveConfig = false;

// Hub State
String deviceId;
String apiKey = "";
bool isApproved = false;

// Mock Data State
struct SensorData {
  String id;
  String type;
  float value;
  String name;
};
struct RelayData {
  String id;
  bool state;
  String name;
};

std::vector<SensorData> pairedSensors;
std::vector<RelayData> pairedRelays;
std::map<String, String> deviceNames;

void saveDeviceNames() {
  DynamicJsonDocument doc(2048);
  for (auto const& item : deviceNames) {
    doc[item.first] = item.second;
  }
  File file = LittleFS.open("/device_names.json", "w");
  if (file) {
    serializeJson(doc, file);
    file.close();
  }
}

void loadDeviceNames() {
  if (LittleFS.exists("/device_names.json")) {
    File file = LittleFS.open("/device_names.json", "r");
    if (file) {
      DynamicJsonDocument doc(2048);
      deserializeJson(doc, file);
      JsonObject obj = doc.as<JsonObject>();
      for (JsonPair p : obj) {
        deviceNames[p.key().c_str()] = p.value().as<String>();
      }
      file.close();
    }
  }
}

// Web Server for Mock UI
ESP8266WebServer server(80);

void saveDevices() {
  DynamicJsonDocument doc(2048);
  JsonArray sArr = doc.createNestedArray("sensors");
  for (auto &s : pairedSensors) {
    JsonObject obj = sArr.createNestedObject();
    obj["id"] = s.id;
    obj["type"] = s.type;
    obj["val"] = s.value;
    obj["name"] = s.name;
  }
  JsonArray rArr = doc.createNestedArray("relays");
  for (auto &r : pairedRelays) {
    JsonObject obj = rArr.createNestedObject();
    obj["id"] = r.id;
    obj["state"] = r.state;
    obj["name"] = r.name;
  }
  File file = LittleFS.open("/devices.json", "w");
  if (file) {
    serializeJson(doc, file);
    file.close();
  }
}

void loadDevices() {
  if (LittleFS.exists("/devices.json")) {
    File file = LittleFS.open("/devices.json", "r");
    if (file) {
      DynamicJsonDocument doc(2048);
      deserializeJson(doc, file);
      JsonArray sArr = doc["sensors"];
      for (JsonObject s : sArr) {
        String n = s["name"] | "";
        pairedSensors.push_back({s["id"], s["type"], s["val"], n});
      }
      JsonArray rArr = doc["relays"];
      for (JsonObject r : rArr) {
        String n = r["name"] | "";
        pairedRelays.push_back({r["id"], r["state"], n});
      }
      file.close();
    }
  }
}

void saveConfigCallback () {
  Serial.println("Should save config");
  shouldSaveConfig = true;
}

void setupSpiffs() {
  if (LittleFS.begin()) {
    if (LittleFS.exists("/config.json")) {
      File configFile = LittleFS.open("/config.json", "r");
      if (configFile) {
        size_t size = configFile.size();
        std::unique_ptr<char[]> buf(new char[size]);
        configFile.readBytes(buf.get(), size);
        DynamicJsonDocument json(1024);
        if (!deserializeJson(json, buf.get())) {
          strcpy(api_server, json["api_server"]);
          strcpy(user_email, json["user_email"]);
          if (json.containsKey("api_key")) apiKey = json["api_key"].as<String>();
          if (json.containsKey("is_approved")) isApproved = json["is_approved"];
        }
      }
    }
  } else {
    Serial.println("Failed to mount FS");
    LittleFS.format();
  }
}

void saveConfig() {
  DynamicJsonDocument json(1024);
  json["api_server"] = api_server;
  json["user_email"] = user_email;
  json["api_key"] = apiKey;
  json["is_approved"] = isApproved;

  File configFile = LittleFS.open("/config.json", "w");
  if (configFile) {
    serializeJson(json, configFile);
    configFile.close();
  }
}

void handleReset() {
  WiFiManager wm;
  wm.resetSettings();
  LittleFS.format(); // Also clear our config
  server.send(200, "text/plain", "Settings cleared. Rebooting into AP mode...");
  delay(1000);
  ESP.reset();
}

void handleSaveSettings() {
  if (server.hasArg("server") && server.hasArg("email")) {
    String s = server.arg("server");
    String e = server.arg("email");
    
    if (s.length() < 64 && e.length() < 64) {
      strcpy(api_server, s.c_str());
      strcpy(user_email, e.c_str());
      saveConfig();
      server.sendHeader("Location", "/");
      server.send(303);
    } else {
      server.send(400, "text/plain", "Input too long");
    }
  } else {
    server.send(400, "text/plain", "Missing arguments");
  }
}

void handlePair() {
  String type = server.arg("type");
  String unitId = "dev_" + String(random(1000, 9999)); // More robust semi-unique ID
  
  if (type == "sensor") {
    // Add 4 sensors
    pairedSensors.push_back({unitId + ":moisture", "soil_moisture", 30.0, "Soil Moisture"});
    pairedSensors.push_back({unitId + ":temp", "temperature", 22.5, "Temperature"});
    pairedSensors.push_back({unitId + ":humidity", "humidity", 45.0, "Humidity"});
    pairedSensors.push_back({unitId + ":light", "light", 500.0, "Light"});
  } else if (type == "relay") {
    // Add 1 relay
    pairedRelays.push_back({unitId + ":relay_1", false, "Main Valve"});
  }

  saveDevices();
  server.sendHeader("Location", "/");
  server.send(303);
}

void handleRemove() {
  if (server.hasArg("id")) {
    String prefix = server.arg("id");
    if (!prefix.endsWith(":")) prefix += ":";
    
    // Remove all entities belonging to this unit
    pairedSensors.erase(std::remove_if(pairedSensors.begin(), pairedSensors.end(), [&](SensorData &s){ return s.id.startsWith(prefix); }), pairedSensors.end());
    pairedRelays.erase(std::remove_if(pairedRelays.begin(), pairedRelays.end(), [&](RelayData &r){ return r.id.startsWith(prefix); }), pairedRelays.end());
    
