mferi87/yieldassist/firmware/esp8266_mock/src/main.cpp
    saveDevices();
  }
  server.sendHeader("Location", "/");
  server.send(303);
}

void handleRoot() {
  String html = "<!DOCTYPE html><html><head><meta name='viewport' content='width=device-width, initial-scale=1'><title>YieldAssist Hub Mock</title>";
  html += "<style>body{font-family:Arial;text-align:center;padding:10px;max-width:800px;margin:0 auto;background:#f0f2f5;} .card{background:white;padding:20px;margin:10px 0;border-radius:15px;box-shadow:0 4px 6px rgba(0,0,0,0.05);} .btn{padding:10px 20px;border:none;border-radius:8px;cursor:pointer;font-weight:bold;transition:all 0.2s;} .btn-primary{background:#007bff;color:white;} .btn-danger{background:#dc3545;color:white;padding:5px 10px;} .btn-success{background:#28a745;color:white;} .btn-gray{background:#6c757d;color:white;} .slider{width:100%;} table{width:100%;border-collapse:collapse;margin-top:20px;} th,td{padding:12px;text-align:left;border-bottom:1px solid #eee;} .badge{padding:4px 8px;border-radius:4px;font-size:12px;font-weight:bold;text-transform:uppercase;} .grid{display:grid;grid-template-columns:1fr 1fr;gap:20px;} @media(max-width:600px){.grid{grid-template-columns:1fr;}}</style></head><body>";
  html += "<h1>YieldAssist Hub</h1>";
  
  html += "<div class='grid'>";
  
  // Status & Config
  html += "<div><div class='card'>";
  html += "<p><strong>ID:</strong> " + deviceId + "</p>";
  html += isApproved ? "<p style='color:green;'>● Connected</p>" : "<p style='color:orange;'>● Pending Approval</p>";
  html += "</div>";

  html += "<div class='card'><h3>System Setup</h3>";
  html += "<form action='/save_settings' method='POST'>";
  html += "<input type='text' name='server' value='" + String(api_server) + "' placeholder='Server' style='width:90%;margin-bottom:10px;'><br>";
  html += "<input type='text' name='email' value='" + String(user_email) + "' placeholder='Email' style='width:90%;margin-bottom:10px;'><br>";
  html += "<button type='submit' class='btn btn-primary'>Apply Config</button>";
  html += "</form></div></div>";

  // Pairing Actions
  html += "<div class='card'><h3>Add Hardware</h3>";
  html += "<div style='display:flex;gap:10px;justify-content:center;'>";
  html += "<form action='/pair' method='GET'><input type='hidden' name='type' value='sensor'><button type='submit' class='btn btn-success'>Pair Sensor (4 In 1)</button></form>";
  html += "<form action='/pair' method='GET'><input type='hidden' name='type' value='relay'><button type='submit' class='btn btn-success'>Pair Relay (1 Ch)</button></form>";
  html += "</div></div>";

  html += "</div>"; // end grid

  // Grouped Devices List
  std::map<String, std::vector<SensorData>> groupedSensors;
  for(auto &s : pairedSensors) {
    int colonPos = s.id.indexOf(':');
    String unit = (colonPos != -1) ? s.id.substring(0, colonPos) : "Standalone";
    groupedSensors[unit].push_back(s);
  }

  std::map<String, std::vector<RelayData>> groupedRelays;
  for(auto &r : pairedRelays) {
    int colonPos = r.id.indexOf(':');
    String unit = (colonPos != -1) ? r.id.substring(0, colonPos) : "Standalone";
    groupedRelays[unit].push_back(r);
  }

  // Get unique units
  std::vector<String> units;
  for(auto const& it : groupedSensors) units.push_back(it.first);
  for(auto const& it : groupedRelays) {
    if (std::find(units.begin(), units.end(), it.first) == units.end()) units.push_back(it.first);
  }

  for (String unit : units) {
    String dName = deviceNames.count(unit) ? deviceNames[unit] : unit;
    html += "<div class='card'><h2>Device: <input type='text' id='dn_" + unit + "' value='" + dName + "' style='font-size:1.2rem;width:200px'> <button onclick='updateDeviceName(\"" + unit + "\", document.getElementById(\"dn_" + unit + "\").value)' class='btn'>Save</button> <button onclick='removeDev(\"" + unit + "\")' class='btn btn-danger' style='float:right;font-size:12px'>Remove</button></h2>";
    html += "<table><tr><th>Name / Entity</th><th>Type</th><th>Control / Status</th></tr>";
    
    if (groupedSensors.count(unit)) {
      for (auto &s : groupedSensors[unit]) {
        html += "<tr><td><input type='text' value='" + s.name + "' onchange='updateName(\"" + s.id + "\", this.value)' style='width:120px;border:1px solid #ccc;padding:4px;border-radius:4px;'><br><code>" + s.id + "</code></td>";
        html += "<td><span class='badge' style='background:#e7f3ff;color:#007bff;'>" + s.type + "</span></td>";
        html += "<td><input type='range' min='0' max='1000' value='" + String((int)s.value) + "' class='slider' onchange='updateVal(\"" + s.id + "\", this.value)'><br>" + String(s.value) + "</td></tr>";
      }
    }

    if (groupedRelays.count(unit)) {
      for (auto &r : groupedRelays[unit]) {
        html += "<tr><td><input type='text' value='" + r.name + "' onchange='updateName(\"" + r.id + "\", this.value)' style='width:120px;border:1px solid #ccc;padding:4px;border-radius:4px;'><br><code>" + r.id + "</code></td>";
        html += "<td><span class='badge' style='background:#fef1f2;color:#dc3545;'>RELAY</span></td>";
        html += "<td><button onclick='toggleRelay(\"" + r.id + "\")' class='btn " + String(r.state ? "btn-success" : "btn-gray") + "'>" + String(r.state ? "ON" : "OFF") + "</button></td></tr>";
      }
    }
    html += "</table></div>";
  }

  html += "<div class='card'><button onclick='if(confirm(\"Reset?\"))location.href=\"/reset\"' class='btn btn-danger'>Factory Reset</button></div>";

  html += "<script>function updateVal(id,val){fetch('/set?id='+id+'&val='+val);} function toggleRelay(id){fetch('/toggle?id='+id); setTimeout(()=>location.reload(), 200);} function removeDev(id){if(confirm(\"Remove \"+id+\"?\")) {fetch('/remove?id='+id); setTimeout(()=>location.reload(), 200);}} function updateName(id,name){fetch('/set_name?id='+id+'&name='+encodeURIComponent(name));} function updateDeviceName(id,name){fetch('/set_device_name?id='+id+'&name='+encodeURIComponent(name));}</script>";
  html += "</body></html>";
  server.send(200, "text/html", html);
}

void handleSetDeviceName() {
  if (server.hasArg("id") && server.hasArg("name")) {
     String id = server.arg("id");
     String name = server.arg("name");
     deviceNames[id] = name;
     saveDeviceNames();
  }
  server.send(200, "text/plain", "OK");
}

void handleSet() {
  if (server.hasArg("id") && server.hasArg("val")) {
    String id = server.arg("id");
    float val = server.arg("val").toFloat();
    for (auto &s : pairedSensors) {
      if (s.id == id) s.value = val;
    }
  }
  server.send(200, "text/plain", "OK");
}

void handleSetName() {
  if (server.hasArg("id") && server.hasArg("name")) {
    String id = server.arg("id");
    String name = server.arg("name");
    for (auto &s : pairedSensors) {
      if (s.id == id) s.name = name;
    }
    for (auto &r : pairedRelays) {
      if (r.id == id) r.name = name;
    }
    saveDevices();
  }
  server.send(200, "text/plain", "OK");
}

void handleToggle() {
  if (server.hasArg("id")) {
    String id = server.arg("id");
    for (auto &r : pairedRelays) {
      if (r.id == id) r.state = !r.state;
    }
  }
  server.send(200, "text/plain", "OK");
}

DynamicJsonDocument automationsDoc(4096);
std::map<String, bool> ruleStates;

void loadAutomations() {
  if (LittleFS.exists("/automations.json")) {
    File file = LittleFS.open("/automations.json", "r");
    if (file) {
      deserializeJson(automationsDoc, file);
      file.close();
      Serial.println("Loaded local automations");
    }
  }
}

