mferi87/yieldassist/firmware/esp8266_mock/src/main.cpp
void saveAutomations() {
  File file = LittleFS.open("/automations.json", "w");
  if (file) {
    serializeJson(automationsDoc, file);
    file.close();
    Serial.println("Saved local automations");
  }
}

bool evaluateBlock(JsonObject block) {
  String type = block["type"];
  if (type == "sensor") {
    String devId = block["device_id"];
    String op = block["operator"];
    float target = block["value"];
    float current = -1;

    for (auto &s : pairedSensors) {
      if (s.id == devId) {
        current = s.value;
        break;
      }
    }
    
    if (current == -1) return false;
    
    if (op == "<") return current < target;
    if (op == ">") return current > target;
    if (op == "==") return current == target;
    if (op == "!=") return current != target;
  }
  return false;
}

void executeAction(JsonObject action) {
  String devId = action["device_id"];
  String act = action["action"];
  
  for (auto &r : pairedRelays) {
    if (r.id == devId) {
      if (act == "open") r.state = true;
      else if (act == "close") r.state = false;
      else if (act == "toggle") r.state = !r.state;
      Serial.println("Automation triggered " + devId + ": " + act);
      break;
    }
  }
}

void processLocalAutomations() {
  if (!automationsDoc.is<JsonArray>()) return;
  
  JsonArray rules = automationsDoc.as<JsonArray>();
  for (JsonObject rule : rules) {
    String ruleId = rule["id"] | "unknown";
    bool isEnabled = rule["is_enabled"] | true;
    if (!isEnabled) continue;

    // Triggers (When) - At least one must be true
    bool triggered = false;
    JsonArray triggers = rule["triggers"];
    for (JsonObject t : triggers) {
      if (evaluateBlock(t)) {
        triggered = true;
        break;
      }
    }
    
    // Conditions (And If) - All must be true
    bool conditionsMet = true;
    if (triggered) {
      JsonArray conditions = rule["conditions"];
      for (JsonObject c : conditions) {
        if (!evaluateBlock(c)) {
          conditionsMet = false;
          break;
        }
      }
    }

    bool currentlyActive = triggered && conditionsMet;
    bool previouslyActive = ruleStates[ruleId];

    // Edge Trigger: Only execute if transitioning from inactive to active
    if (currentlyActive && !previouslyActive) {
      JsonArray actions = rule["actions"];
      for (JsonObject a : actions) {
        executeAction(a);
      }
    }

    // Store state for next comparison
    ruleStates[ruleId] = currentlyActive;
  }
}

// ISRG Root X1 Certificate (Let's Encrypt)
const char* lets_encrypt_root_ca = \
"-----BEGIN CERTIFICATE-----\n" \
"MIIFazCCA1OgAwIBAgIRAIIQz7DSQONZRGPgu2OCiwAwDQYJKoZIhvcNAQELBQAw\n" \
"TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh\n" \
"cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwHhcNMTUwNjA0MTEwNDM4\n" \
"WhcNMzUwNjA0MTEwNDM4WjBPMQswCQYDVQQGEwJVUzEpMCcGA1UEChMgSW50ZXJu\n" \
"ZXQgU2VjdXJpdHkgUmVzZWFyY2ggR3JvdXAxFTATBgNVBAMTDElTUkcgUm9vdCBY\n" \
"MTCCAiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAK3oJHP0FDfzm54rVygc\n" \
"h77ct984kIxuPOZXoHj3dcKi/vVqbvYATyjb3miGbESTtrFj/RQSa78f0uoxmyF+\n" \
"0TM8ukj13Xnfs7j/EvEhmkvBioZxaUpmZmyPfjxwv60pIgbz5MDmgK7iS4+3mX6U\n" \
"A5/TR5d8mUgjU+g4rk8Kb4Mu0UlXjIB0ttov0DiNewNwIRt18jA8+o+u3dpjq+sW\n" \
"T8KOEUt+zwvo/7V3LvSye0rgTBIlDHCNAymg4VMk7BPZ7hm/ELNKjD+Jo2FR3qyH\n" \
"B5T0Y3HsLuJvW5iB4YlcNHlsdu87kGJ55tukmi8mxdAQ4Q7e2RCOFvu396j3x+UC\n" \
"B5iPNgiV5+I3lg02dZ77DnKxHZu8A/lJBdiB3QW0KtZB6awBdpUKD9jf1b0SHzUv\n" \
"KBds0pjBqAlkd25HN7rOrFleaJ1/ctaJxQZBKT5ZPt0m9STJEadao0xAH0ahmbWn\n" \
"OlFuhjuefXKnEgV4We0+UXgVCwOPjdAvBbI+e0ocS3MFEvzG6uBQE3xDk3SzynTn\n" \
"jh8BCNAw1FtxNrQHusEwMFxIt4I7mKZ9YIqioymCzLq9gwQbooMDQaHWBfEbwrbw\n" \
"qHyGO0aoSCqI3Haadr8faqU9GY/rOPNk3sgrDQoo//fb4hVC1CLQJ13hef4Y53CI\n" \
"rU7m2Ys6xt0nUW7/vGT1M0NPAgMBAAGjQjBAMA4GA1UdDwEB/wQEAwIBBjAPBgNV\n" \
"HRMBAf8EBTADAQH/MB0GA1UdDgQWBBR5tFnme7bl5AFzgAiIyBpY9umbbjANBgkq\n" \
"hkiG9w0BAQsFAAOCAgEAVR9YqbyyqFDQDLHYGmkgJykIrGF1XIpu+ILlaS/V9lZL\n" \
"ubhzEFnTIZd+50xx+7LSYK05qAvqFyFWhfFQDlnrzuBZ6brJFe+GnY+EgPbk6ZGQ\n" \
"3BebYhtF8GaV0nxvwuo77x/Py9auJ/GpsMiu/X1+mvoiBOv/2X/qkSsisRcOj/KK\n" \
"NFtY2PwByVS5uCbMiogziUwthDyC3+6WVwW6LLv3xLfHTjuCvjHIInNzktHCgKQ5\n" \
"ORAzI4JMPJ+GslWYHb4phowim57iaztXOoJwTdwJx4nLCgdNbOhdjsnvzqvHu7Ur\n" \
"TkXWStAmzOVyyghqpZXjFaH3pO3JLF+l+/+sKAIuvtd7u+Nxe5AW0wdeRlN8NwdC\n" \
"jNPElpzVmbUq4JUagEiuTDkHzsxHpFKVK7q4+63SM1N95R1NbdWhscdCb+ZAJzVc\n" \
"oyi3B43njTOQ5yOf+1CceWxG1bQVs5ZufpsMljq4Ui0/1lvh+wjChP4kqKOJ2qxq\n" \
"4RgqsahDYVvTH9w7jXbyLeiNdd8XM2w9U/t7y0Ff/9yi0GE44Za4rF2LN9d11TPA\n" \
"mRGunUHBcnWEvgJBQl9nJEiU0Zsnvgc/ubhPgXRR4Xq37Z0j4r7g1SgEEzwxA57d\n" \
"emyPxgcYxn/eR44/KJ4EBs+lVDR3veyJm+kXQ99b21/+jh5Xos1AnX5iItreGCc=\n" \
"-----END CERTIFICATE-----\n";

void registerHub() {
  std::unique_ptr<WiFiClient> client;
  X509List cert(lets_encrypt_root_ca);
  bool isSecure = String(api_server).startsWith("https");

  if (isSecure) {
    WiFiClientSecure *sClient = new WiFiClientSecure();
    sClient->setTrustAnchors(&cert);
    client.reset(sClient);
  } else {
    client.reset(new WiFiClient());
  }

  HTTPClient http;
  String url = String(api_server) + "/api/hubs/register";
  
  Serial.print("Connecting to: ");
  Serial.println(url);
  Serial.print("WiFi Status: ");
  Serial.println(WiFi.status());
  Serial.print("Local IP: ");
  Serial.println(WiFi.localIP());

  http.begin(*client, url);
  http.addHeader("Content-Type", "application/json");

  DynamicJsonDocument doc(1024);
  doc["device_id"] = deviceId;
  doc["email"] = user_email;
  
  String requestBody;
  serializeJson(doc, requestBody);
  
  int httpCode = http.POST(requestBody);
  Serial.printf("Register Hub: %d\n", httpCode);
  http.end();
}

void checkApproval() {
  std::unique_ptr<WiFiClient> client;
  X509List cert(lets_encrypt_root_ca);
  bool isSecure = String(api_server).startsWith("https");

  if (isSecure) {
    WiFiClientSecure *sClient = new WiFiClientSecure();
    sClient->setTrustAnchors(&cert);
    client.reset(sClient);
  } else {
    client.reset(new WiFiClient());
  }

  HTTPClient http;
  String url = String(api_server) + "/api/hubs/check-status";
  
  http.begin(*client, url);
  http.addHeader("Content-Type", "application/json");
  
  DynamicJsonDocument doc(1024);
  doc["device_id"] = deviceId;
  String requestBody;
  serializeJson(doc, requestBody);
  
  int httpCode = http.POST(requestBody);
  if (httpCode == 200) {
    String payload = http.getString();
    DynamicJsonDocument res(1024);
    deserializeJson(res, payload);
    
    bool approved = res["is_approved"];
    if (approved) {
      apiKey = res["api_key"].as<String>();
      isApproved = true;
      saveConfig();
      Serial.println("Hub Approved! API Key saved.");
    }
  }
  http.end();
}

void sendSensorData() {
  if (!isApproved) return;
  
