mferi87/yieldassist/firmware/esp8266_mock/src/main.cpp
  std::unique_ptr<WiFiClient> client;
  X509List cert(lets_encrypt_root_ca);
  bool isSecure = String(api_server).startsWith("https");

  if (isSecure) {
    WiFiClientSecure *sClient = new WiFiClientSecure();
    sClient->setTrustAnchors(&cert);
    client.reset(sClient);
  } else {
    client.reset(new WiFiClient());
  }

  HTTPClient http;
  String url = String(api_server) + "/api/hubs/data";
  
  http.begin(*client, url);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Hub-Api-Key", apiKey);
  
  DynamicJsonDocument doc(4096);
  JsonArray readings = doc.createNestedArray("readings");
  for (auto &s : pairedSensors) {
    JsonObject obj = readings.createNestedObject();
    obj["sensor_id"] = s.id;
    obj["sensor_type"] = s.type;
    obj["value"] = s.value;
    if (s.name.length() > 0) obj["name"] = s.name;
  }

  JsonArray valves = doc.createNestedArray("valves");
  for (auto &r : pairedRelays) {
    JsonObject obj = valves.createNestedObject();
    obj["valve_id"] = r.id;
    obj["is_open"] = r.state;
    if (r.name.length() > 0) obj["name"] = r.name;
  }

  doc["uptime"] = millis() / 1000;
  doc["wifi_rssi"] = WiFi.RSSI();
  
  // Peripherals
  JsonArray peripherals = doc.createNestedArray("peripherals");
  std::set<String> unitIds;
  for(auto &s : pairedSensors) {
     int colon = s.id.indexOf(':');
     if (colon != -1) unitIds.insert(s.id.substring(0, colon));
  }
  for(auto &r : pairedRelays) {
     int colon = r.id.indexOf(':');
     if (colon != -1) unitIds.insert(r.id.substring(0, colon));
  }
  
  for(auto const& id : unitIds) {
      if (deviceNames.count(id)) {
           JsonObject p = peripherals.createNestedObject();
           p["peripheral_id"] = id;
           p["name"] = deviceNames[id];
      }
  }

  String requestBody;
  serializeJson(doc, requestBody);
  
  int httpCode = http.POST(requestBody);
  Serial.printf("Send Data: %d\n", httpCode);

  if (httpCode == 200) {
      String payload = http.getString();
      DynamicJsonDocument res(4096);
      DeserializationError error = deserializeJson(res, payload);
      
      if (!error) {
           // Process Sync Commands
           // Process Sync Commands
           if (res.containsKey("sync")) {
               JsonObject sync = res["sync"];
               if (sync.containsKey("valves")) {
                   JsonArray valvesArr = sync["valves"];
                   for (JsonObject v : valvesArr) {
                       String vid = v["valve_id"];
                       for (auto &r : pairedRelays) {
                           if (r.id == vid) {
                               if (v.containsKey("is_open")) {
                                   r.state = v["is_open"];
                                   Serial.println("Synced relay state " + vid + ": " + String(r.state));
                               }
                               if (v.containsKey("name")) {
                                   String newName = v["name"];
                                   if (newName.length() > 0) r.name = newName;
                               }
                           }
                       }
                   }
               }
               if (sync.containsKey("sensors")) {
                   JsonArray sensorsArr = sync["sensors"];
                   for (JsonObject s : sensorsArr) {
                       String sid = s["sensor_id"];
                       for (auto &localS : pairedSensors) {
                           if (localS.id == sid) {
                               if (s.containsKey("name")) {
                                   String newName = s["name"];
                                   if (newName.length() > 0) localS.name = newName;
                               }
                           }
                       }
                   }
               }
                if (sync.containsKey("peripherals")) {
                    JsonArray pArr = sync["peripherals"];
                    for (JsonObject p : pArr) {
                        String id = p["id"];
                        String name = p["name"];
                        deviceNames[id] = name;
                    }
                    saveDeviceNames();
                }
                saveDevices();
           }
           
           // Process/Update Automations
           if (res.containsKey("automations")) {
               automationsDoc = res["automations"];
               saveAutomations();
               Serial.println("Updated local automations from server");
           }
      }
  }

  http.end();
}

void setup() {
  Serial.begin(115200);
  setupSpiffs();
  loadDevices();
  loadDeviceNames();
  loadAutomations();

  WiFiManager wifiManager;
  wifiManager.setSaveConfigCallback(saveConfigCallback);
  
  WiFiManagerParameter custom_api_server("server", "API Server", api_server, 64);
  WiFiManagerParameter custom_user_email("email", "User Email", user_email, 64);
  
  wifiManager.addParameter(&custom_api_server);
  wifiManager.addParameter(&custom_user_email);

  if (!wifiManager.autoConnect("YieldAssist-Hub")) {
    delay(3000);
    ESP.reset();
  }

  strcpy(api_server, custom_api_server.getValue());
  strcpy(user_email, custom_user_email.getValue());

  if (shouldSaveConfig) saveConfig();

  deviceId = WiFi.macAddress();
  Serial.println("Device ID: " + deviceId);

  server.on("/", handleRoot);
  server.on("/set", handleSet);
  server.on("/set_name", handleSetName);
  server.on("/set_device_name", handleSetDeviceName);
  server.on("/toggle", handleToggle);
  server.on("/pair", handlePair);
  server.on("/remove", handleRemove);
  server.on("/save_settings", handleSaveSettings);
  server.on("/reset", handleReset);
  server.begin();
}

unsigned long lastPoll = 0;
unsigned long lastData = 0;

void loop() {
  server.handleClient();
  
  if (millis() - lastPoll > 10000) {
    lastPoll = millis();
    if (!isApproved) {
      registerHub(); // Keep trying to register/ensure registered
      checkApproval();
    }
  }
  
  if (isApproved && millis() - lastData > 5000) {
     lastData = millis();
     sendSensorData();
  }

  processLocalAutomations();
}
